tap "adoptopenjdk/openjdk"
tap "dart-lang/dart"
tap "facebook/fb"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "sass/sass"
tap "yt-dlp/taps"
brew "age"
brew "python@3.9"
brew "openjdk"
brew "apktool"
brew "python@3.10"
brew "asciinema"
brew "coreutils"
brew "python@3.11"
brew "fastlane"
# brew "tmux"
# brew "byobu"
brew "chruby"
brew "gnutls"
brew "colima"
# https://github.com/jakehilborn/displayplacer
# tap "jakehilborn/jakehilborn" 
# brew "displayplacer"
brew "docker"
brew "docker-compose"
# brew "tesseract"
brew "ffmpeg"
brew "git"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gradle"
brew "grep"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "ipython"
brew "jq"
brew "krb5"
brew "lab"
brew "libpq"
brew "libwebsockets"
brew "libyaml"
# brew "lynx"
brew "magic-wormhole"
# brew "mitmproxy"
# brew "mosquitto"
brew "ncdu"
brew "openssl@3", link: false
# brew "nmap"
brew "node"
brew "nvm"
brew "postgresql@14"
brew "qrencode"
brew "rsync"
brew "ruby"
# brew "sshfs"
brew "watchman"
brew "wdiff"
brew "wget"
# brew "whois"
brew "yamllint"
brew "yq"
brew "zbar"
brew "sass/sass/sass"
brew "yt-dlp/taps/yt-dlp"
cask "firefox"
# cask "brackets"
# cask "chrysalis"
cask "cool-retro-term"
# cask "discord"
cask "keepassxc"
cask "openlens"
cask "vlc"
cask "spotify"
cask "inkscape"
cask "iterm2"
cask "rectangle"
# cask "signal"
# cask "element"
cask "visual-studio-code"
cask "slack"
# cask "synergy-core"
# cask "wireshark"
# steno
#cask "plover"
# android builds
cask "adoptopenjdk/openjdk/adoptopenjdk11"
cask "responsively"
# cask "obs"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bungcip.better-toml"
vscode "christian-kohler.path-intellisense"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitLab.gitlab-workflow"
vscode "golang.go"
vscode "humao.rest-client"
vscode "jasonnutter.vscode-codeowners"
vscode "keesschollaart.vscode-home-assistant"
vscode "lextudio.restructuredtext"
vscode "mathematic.vscode-latex"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "Orta.vscode-jest"
vscode "platformio.platformio-ide"
vscode "tootone.org-mode"
vscode "trond-snekvik.simple-rst"
vscode "twxs.cmake"
vscode "verydanny.vcslack"
vscode "vstirbu.vscode-mermaid-preview"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
